lkolbly/cmsis-svd/data/Cypress/S6E2C5.svd
        <!-- REGISTER "IRQ007SEL" -->
        <register>
          <name>IRQ007SEL</name>
          <description>Relocate Interrupt Selection Register (IRQ007)</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT" -->
            <field>
              <name>SELBIT</name>
              <description>Bit7 of the interrupt source is moved to bit7 of the relocate interrupt.</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description>specify the IRQ no. of a peripheral interrupt to be relocated</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ008SEL" -->
        <register>
          <name>IRQ008SEL</name>
          <description>Relocate Interrupt Selection Register (IRQ008)</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT" -->
            <field>
              <name>SELBIT</name>
              <description>Bit7 of the interrupt source is moved to bit7 of the relocate interrupt.</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description>specify the IRQ no. of a peripheral interrupt to be relocated</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ009SEL" -->
        <register>
          <name>IRQ009SEL</name>
          <description>Relocate Interrupt Selection Register (IRQ009)</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT" -->
            <field>
              <name>SELBIT</name>
              <description>Bit7 of the interrupt source is moved to bit7 of the relocate interrupt.</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description>specify the IRQ no. of a peripheral interrupt to be relocated</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ010SEL" -->
        <register>
          <name>IRQ010SEL</name>
          <description>Relocate Interrupt Selection Register (IRQ010)</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT" -->
            <field>
              <name>SELBIT</name>
              <description>Bit7 of the interrupt source is moved to bit7 of the relocate interrupt.</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description>specify the IRQ no. of a peripheral interrupt to be relocated</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EXC02MON" -->
        <register>
          <name>EXC02MON</name>
          <description>EXC02 batch read register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HWINT" -->
            <field>
              <name>HWINT</name>
              <description>Interrupt request of the hardware watchdog timer</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NMI" -->
            <field>
              <name>NMI</name>
              <description>Interrupt request of the NMIX external pin</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ000MON" -->
        <register>
          <name>IRQ000MON</name>
          <description>IRQ000 Batch Read Register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FCSINT" -->
            <field>
              <name>FCSINT</name>
              <description>Interrupt request of the anomalous frequency detected by the CSV</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ001MON" -->
        <register>
          <name>IRQ001MON</name>
          <description>IRQ001 Batch Read Register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SWWDTINT" -->
            <field>
              <name>SWWDTINT</name>
              <description>interrupt request of the software watchdog timer</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ002MON" -->
        <register>
          <name>IRQ002MON</name>
          <description>IRQ002 Batch Read Register</description>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDINT" -->
            <field>
              <name>LVDINT</name>
              <description>Low-voltage detection (LVD) interrupt request</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
