lkolbly/cmsis-svd/data/Cypress/S6E2C5.svd
        <!-- REGISTER "INTPND1" -->
        <register>
          <name>INTPND1</name>
          <description>CAN Interrupt Pending Registers 1</description>
          <addressOffset>0xA0</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INTPND16" -->
            <field>
              <name>INTPND16</name>
              <description>Bit15 of INTPND1</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND15" -->
            <field>
              <name>INTPND15</name>
              <description>Bit14 of INTPND1</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND14" -->
            <field>
              <name>INTPND14</name>
              <description>Bit13 of INTPND1</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND13" -->
            <field>
              <name>INTPND13</name>
              <description>Bit12 of INTPND1</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND12" -->
            <field>
              <name>INTPND12</name>
              <description>Bit11 of INTPND1</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND11" -->
            <field>
              <name>INTPND11</name>
              <description>Bit10 of INTPND1</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND10" -->
            <field>
              <name>INTPND10</name>
              <description>Bit9 of INTPND1</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND9" -->
            <field>
              <name>INTPND9</name>
              <description>Bit8 of INTPND1</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND8" -->
            <field>
              <name>INTPND8</name>
              <description>Bit7 of INTPND1</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND7" -->
            <field>
              <name>INTPND7</name>
              <description>Bit6 of INTPND1</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND6" -->
            <field>
              <name>INTPND6</name>
              <description>Bit5 of INTPND1</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND5" -->
            <field>
              <name>INTPND5</name>
              <description>Bit4 of INTPND1</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND4" -->
            <field>
              <name>INTPND4</name>
              <description>Bit3 of INTPND1</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND3" -->
            <field>
              <name>INTPND3</name>
              <description>Bit2 of INTPND1</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND2" -->
            <field>
              <name>INTPND2</name>
              <description>Bit1 of INTPND1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND1" -->
            <field>
              <name>INTPND1</name>
              <description>Bit0 of INTPND1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "INTPND2" -->
        <register>
          <name>INTPND2</name>
          <description>CAN Interrupt Pending Registers 2</description>
          <addressOffset>0xA2</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INTPND32" -->
            <field>
              <name>INTPND32</name>
              <description>Bit15 of INTPND2</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND31" -->
            <field>
              <name>INTPND31</name>
              <description>Bit14 of INTPND2</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND30" -->
            <field>
              <name>INTPND30</name>
              <description>Bit13 of INTPND2</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND29" -->
            <field>
              <name>INTPND29</name>
              <description>Bit12 of INTPND2</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND28" -->
            <field>
              <name>INTPND28</name>
              <description>Bit11 of INTPND2</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND27" -->
            <field>
              <name>INTPND27</name>
              <description>Bit10 of INTPND2</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND26" -->
            <field>
              <name>INTPND26</name>
              <description>Bit9 of INTPND2</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND25" -->
            <field>
              <name>INTPND25</name>
              <description>Bit8 of INTPND2</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND24" -->
            <field>
              <name>INTPND24</name>
              <description>Bit7 of INTPND2</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND23" -->
            <field>
              <name>INTPND23</name>
              <description>Bit6 of INTPND2</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND22" -->
            <field>
              <name>INTPND22</name>
              <description>Bit5 of INTPND2</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND21" -->
            <field>
              <name>INTPND21</name>
              <description>Bit4 of INTPND2</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND20" -->
            <field>
              <name>INTPND20</name>
              <description>Bit3 of INTPND2</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND19" -->
            <field>
              <name>INTPND19</name>
              <description>Bit2 of INTPND2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND18" -->
            <field>
              <name>INTPND18</name>
              <description>Bit1 of INTPND2</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND17" -->
            <field>
              <name>INTPND17</name>
              <description>Bit0 of INTPND2</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MSGVAL1" -->
        <register>
          <name>MSGVAL1</name>
          <description>CAN Message Valid Registers 1</description>
          <addressOffset>0xB0</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MSGVAL16" -->
            <field>
              <name>MSGVAL16</name>
              <description>Bit15 of MSGVAL1</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL15" -->
            <field>
              <name>MSGVAL15</name>
              <description>Bit14 of MSGVAL1</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL14" -->
            <field>
              <name>MSGVAL14</name>
              <description>Bit13 of MSGVAL1</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL13" -->
            <field>
              <name>MSGVAL13</name>
              <description>Bit12 of MSGVAL1</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL12" -->
            <field>
              <name>MSGVAL12</name>
              <description>Bit11 of MSGVAL1</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL11" -->
            <field>
              <name>MSGVAL11</name>
              <description>Bit10 of MSGVAL1</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL10" -->
            <field>
              <name>MSGVAL10</name>
              <description>Bit9 of MSGVAL1</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL9" -->
            <field>
              <name>MSGVAL9</name>
              <description>Bit8 of MSGVAL1</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL8" -->
            <field>
              <name>MSGVAL8</name>
              <description>Bit7 of MSGVAL1</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL7" -->
            <field>
              <name>MSGVAL7</name>
              <description>Bit6 of MSGVAL1</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL6" -->
            <field>
              <name>MSGVAL6</name>
              <description>Bit5 of MSGVAL1</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL5" -->
            <field>
              <name>MSGVAL5</name>
              <description>Bit4 of MSGVAL1</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL4" -->
            <field>
              <name>MSGVAL4</name>
              <description>Bit3 of MSGVAL1</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL3" -->
            <field>
              <name>MSGVAL3</name>
              <description>Bit2 of MSGVAL1</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL2" -->
            <field>
              <name>MSGVAL2</name>
              <description>Bit1 of MSGVAL1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL1" -->
            <field>
              <name>MSGVAL1</name>
              <description>Bit0 of MSGVAL1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MSGVAL2" -->
        <register>
          <name>MSGVAL2</name>
          <description>CAN Message Valid Registers 2</description>
          <addressOffset>0xB2</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MSGVAL32" -->
            <field>
              <name>MSGVAL32</name>
              <description>Bit15 of MSGVAL2</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL31" -->
            <field>
              <name>MSGVAL31</name>
              <description>Bit14 of MSGVAL2</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL30" -->
            <field>
              <name>MSGVAL30</name>
              <description>Bit13 of MSGVAL2</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL29" -->
            <field>
              <name>MSGVAL29</name>
              <description>Bit12 of MSGVAL2</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL28" -->
            <field>
              <name>MSGVAL28</name>
              <description>Bit11 of MSGVAL2</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL27" -->
            <field>
              <name>MSGVAL27</name>
              <description>Bit10 of MSGVAL2</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL26" -->
            <field>
              <name>MSGVAL26</name>
              <description>Bit9 of MSGVAL2</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL25" -->
            <field>
              <name>MSGVAL25</name>
              <description>Bit8 of MSGVAL2</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL24" -->
            <field>
              <name>MSGVAL24</name>
              <description>Bit7 of MSGVAL2</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL23" -->
            <field>
              <name>MSGVAL23</name>
              <description>Bit6 of MSGVAL2</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL22" -->
            <field>
              <name>MSGVAL22</name>
              <description>Bit5 of MSGVAL2</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL21" -->
            <field>
              <name>MSGVAL21</name>
              <description>Bit4 of MSGVAL2</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL20" -->
            <field>
              <name>MSGVAL20</name>
              <description>Bit3 of MSGVAL2</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL19" -->
            <field>
              <name>MSGVAL19</name>
              <description>Bit2 of MSGVAL2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL18" -->
            <field>
              <name>MSGVAL18</name>
              <description>Bit1 of MSGVAL2</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL17" -->
            <field>
              <name>MSGVAL17</name>
              <description>Bit0 of MSGVAL2</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
