lkolbly/cmsis-svd/data/Cypress/S6E2C5.svd
        <!-- REGISTER "FDSEAR" -->
        <register>
          <name>FDSEAR</name>
          <description>CAN FD ECC Single-bit Error Address Register</description>
          <addressOffset>0x202</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SRA" -->
            <field>
              <name>SRA</name>
              <description>Single-bit error Message RAM address bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FDESCR" -->
        <register>
          <name>FDESCR</name>
          <description>CAN FD ECC Error Status Clear Register</description>
          <addressOffset>0x205</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DEIC" -->
            <field>
              <name>DEIC</name>
              <description>Double-bit error clear bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SEIC" -->
            <field>
              <name>SEIC</name>
              <description>Sngle-bit error clear bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FDDEAR" -->
        <register>
          <name>FDDEAR</name>
          <description>CAN FD ECC Double-bit Error Address Register</description>
          <addressOffset>0x206</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DRA" -->
            <field>
              <name>DRA</name>
              <description>Double-bit error Message RAM address bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSCNTR" -->
        <register>
          <name>TSCNTR</name>
          <description>Time Stamp Control Register</description>
          <addressOffset>0x210</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CCLR" -->
            <field>
              <name>CCLR</name>
              <description>Counter clear bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSMDR" -->
        <register>
          <name>TSMDR</name>
          <description>Time Stamp Mode Register</description>
          <addressOffset>0x212</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CNTEN" -->
            <field>
              <name>CNTEN</name>
              <description>Counter enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSDIVR" -->
        <register>
          <name>TSDIVR</name>
          <description>Time Stamp Divider Register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CDIV" -->
            <field>
              <name>CDIV</name>
              <description>Counter clock division ratio setting bit</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSCDTR" -->
        <register>
          <name>TSCDTR</name>
          <description>Time Stamp Counter Data Register</description>
          <addressOffset>0x218</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CNT" -->
            <field>
              <name>CNT</name>
              <description>Counter value bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSCPCLR" -->
        <register>
          <name>TSCPCLR</name>
          <description>Time Stamp Compare Clear Register</description>
          <addressOffset>0x21A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CMP" -->
            <field>
              <name>CMP</name>
              <description>Compare clear setting bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "I2SPRE" -->
    <peripheral>
      <name>I2SPRE</name>
      <description>I2S Clock Generation</description>
      <groupName>I2SPRE</groupName>
      <baseAddress>0x4003D000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "TIM" -->
      <interrupt>
        <name>TIM</name>
        <value>59</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "ICCR" -->
        <register>
          <name>ICCR</name>
          <description>I2S Clock Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ICSEL" -->
            <field>
              <name>ICSEL</name>
              <description>I2S clock selection bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICEN" -->
            <field>
              <name>ICEN</name>
              <description>I2S clock output enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
