lkolbly/cmsis-svd/data/Cypress/S6E2C5.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "SDIF" -->
    <peripheral>
      <name>SDIF</name>
      <description>SD Card Interface</description>
      <groupName>SDIF</groupName>
      <baseAddress>0x4006E000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "SD" -->
      <interrupt>
        <name>SD</name>
        <value>118</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "DUMMY" -->
        <register>
          <name>DUMMY</name>
          <description>Dummy</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x00</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "PCRC" -->
    <peripheral>
      <name>PCRC</name>
      <description>0</description>
      <groupName>PCRC</groupName>
      <baseAddress>0x40080000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "PRGCRC_I2S" -->
      <interrupt>
        <name>PRGCRC_I2S</name>
        <value>117</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "PRGCRC_POLY" -->
        <register>
          <name>PRGCRC_POLY</name>
          <description>CRC Computing Generator Polynomial Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x04C11DB7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "PRGCRC_SEED" -->
        <register>
          <name>PRGCRC_SEED</name>
          <description>CRC Computing Initial Value Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "PRGCRC_FXOR" -->
        <register>
          <name>PRGCRC_FXOR</name>
          <description>CRC Computing Resault XOR Value Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "PRGCRC_CFG" -->
        <register>
          <name>PRGCRC_CFG</name>
          <description>CRC Computing Configuration Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00E00000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LOCK" -->
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CDEN" -->
            <field>
              <name>CDEN</name>
              <description>DMA request enable</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CIEN" -->
            <field>
              <name>CIEN</name>
              <description>Interrupt request enable</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CIRQ" -->
            <field>
              <name>CIRQ</name>
              <description>Interrupt request</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SZ" -->
            <field>
              <name>SZ</name>
              <description>Input data size</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEST" -->
            <field>
              <name>TEST</name>
              <description>Test</description>
              <lsb>16</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FI" -->
            <field>
              <name>FI</name>
              <description>Input data format</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FO" -->
            <field>
              <name>FO</name>
              <description>output data format</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CIRQCLR" -->
            <field>
              <name>CIRQCLR</name>
              <description>Interrupt request clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PRGCRC_WR" -->
        <register>
          <name>PRGCRC_WR</name>
          <description>CRC Computing Input Data Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
